---
kind: method
id: M:Autodesk.Revit.DB.MultiReferenceAnnotationType.GetAllowedTagCategory
source: html/06cf5deb-d580-4ce1-f0fd-a17b5558b3c9.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationType.GetAllowedTagCategory Method

Returns the category ID for the tag types which can be used by this multi-reference annotation type.

## Syntax (C#)
```csharp
public ElementId GetAllowedTagCategory()
```

## Returns
The allowed tag category ID.

## Remarks
The allowed tag category is determined by the reference category of this multi-reference annotation type.